package com.taiping.constant.capacity;

/**
 * @author hedongwei@wistronits.com
 * description
 * @date 2019/10/31 14:44
 */

public class CapacityResultMsg {

    /************************************容量数据返回消息开始************************************/

    /**
     * 容量分析数据不正确
     */
    public static final String CAPACITY_ANALYZE_ERROR = "容量分析数据不正确";

    /**
     * 容量分析数据成功
     */
    public static final String CAPACITY_ANALYZE_OK = "容量分析数据成功";


    /**
     * 保存预览数据成功
     */
    public static final String SAVE_PREVIEW_DATA_OK = "保存预览数据成功";

    /**
     * 保存预览数据失败
     */
    public static final String SAVE_PREVIEW_DATA_ERROR = "保存预览数据失败";

    /************************************容量数据返回消息结束************************************/
    
    
    
    /********************************机柜基础数据返回消息开始************************************/
    /**
     * 机柜基础数据异常返回消息
     */
    public static final String IMPORT_BASE_CABINET_ERROR = "导入机柜基础数据失败";


    /********************************机柜基础数据返回消息结束************************************/




    /********************************机柜信息数据返回消息开始************************************/
    /**
     * 机柜数据异常返回消息
     */
    public static final String IMPORT_CABINET_ERROR = "导入机柜数据失败";



    /********************************机柜信息数据返回消息结束************************************/







    /*********************************配线架数据返回消息开始************************************/
    /**
     * 配线架异常返回数据
     */
    public static final String IMPORT_CONNECT_RACK_ERROR = "导入配线架数据失败";


    /*********************************配线架数据返回消息结束************************************/







    /********************************综合布线数据返回消息开始************************************/


    /**
     * 综合布线异常返回信息
     */
    public static final String IMPORT_GENERIC_CABLING_ERROR = "导入综合布线数据失败";

    /********************************综合布线数据返回消息结束************************************/







    /*********************************it能耗数据返回消息开始************************************/


    /**
     * it能耗异常返回信息
     */
    public static final String IMPORT_IT_ENERGY_ERROR = "导入IT能耗数据失败";




    /*********************************it能耗数据返回消息结束************************************/


}
