package com.taiping.constant.capacity;

/**
 * 机柜信息返回码
 * @author hedongwei@wistronits.com
 * @date 2019/10/16 17:37
 */
public class CapacityResultCode {



    /********************************容量数据返回码开始************************************/
    /**
     * 容量分析数据不正确
     */
    public static final Integer CAPACITY_ANALYZE_ERROR = 130001;


    /**
     * 保存数据不正确
     */
    public static final Integer SAVE_PREVIEW_DATA_ERROR = 130002;


    /********************************容量数据返回码结束************************************/





    /********************************机柜基础数据返回码开始************************************/
    /**
     * 机柜基础数据异常返回码
     */
    public static final Integer IMPORT_BASE_CABINET_ERROR = 131001;


    /********************************机柜基础数据返回码结束************************************/




    /********************************机柜信息数据返回码开始************************************/
    /**
     * 机柜数据异常返回码
     */
    public static final Integer IMPORT_CABINET_ERROR = 132001;



    /********************************机柜信息数据返回码结束************************************/







    /*********************************配线架数据返回码开始************************************/
    /**
     * 配线架异常返回码
     */
    public static final Integer IMPORT_CONNECT_RACK_ERROR = 133001;


    /*********************************配线架数据返回码结束************************************/







    /********************************综合布线数据返回码开始************************************/


    /**
     * 综合布线异常返回码
     */
    public static final Integer IMPORT_GENERIC_CABLING_ERROR = 134001;

    /********************************综合布线数据返回码结束************************************/







    /*********************************it能耗数据返回码开始************************************/


    /**
     * it能耗异常返回码
     */
    public static final Integer IMPORT_IT_ENERGY_ERROR = 135001;




    /*********************************it能耗数据返回码结束************************************/


}
