package com.taiping.constant.energy;

/**
 * 机柜信息返回码
 * @author hedongwei@wistronits.com
 * @date 2019/10/16 17:37
 */
public class EnergyResultCode {


    /********************************能耗数据返回码开始************************************/
    /**
     * 能耗分析数据不正确
     */
    public static final Integer ENERGY_ANALYZE_ERROR = 140001;


    /**
     * 保存数据不正确
     */
    public static final Integer SAVE_PREVIEW_DATA_ERROR = 140002;


    /********************************容量数据返回码结束************************************/








    /********************************动力能耗数据返回码开始************************************/


    /**
     * 动力能耗异常返回码
     */
    public static final Integer IMPORT_POWER_ITEM_ERROR = 141001;

    /********************************综合布线数据返回码结束************************************/







    /*********************************总能耗数据返回码开始************************************/


    /**
     * 总能耗异常返回信息
     */
    public static final Integer IMPORT_ALL_ENERGY_ERROR = 142001;




    /*********************************总能耗数据返回码结束************************************/


}
